use bd_dela;
--Add user data
INSERT INTO Users (date_reg, name, passwd, email) VALUES ('2017-10-21 19:01:00','denis','123321','kird@mail.ru'), ('2011-11-01 11:01:00','inna','123321','inna@mail.ru'), ('2011-08-22 15:01:00','dima','123321','dima@inbox.ru');
--Add projects
INSERT INTO Projects (name_project, user_id) VALUES ('Работа','1'), ('Учеба','3'), ('Входящие','3'), ('Домашние дела','2'), ('Домашние дела','1'),('Домашние дела','3'),('Входящие','1'),('Работа','2'),('Учеба','2');
--Add project data
INSERT INTO Tasks (name_task, user_id, date_create, date_alarm, project_id) VALUES ('Собеседование в IT компании','3','2018-05-21 13:01:00','2018-06-21 13:01:00','1'), ('Выполнить тестовое задание','2','2018-03-01 11:01:00','2018-04-21 13:01:00','2'), ('Сделать задание первого раздела','3','2018-05-01 16:01:00','2018-05-29 13:01:00','2'), ('Встреча с другом','3','2018-05-22 11:01:00','2018-05-22 13:01:00','4'), ('Купить корм для кота','1','2018-04-01 11:01:00','2018-05-21 13:01:00','6'), ('Заказать пиццу','2','2018-03-01 11:01:00','2018-05-04 12:01:00','4'), ('Посадить дерево','1','2018-03-01 11:01:00','2018-05-04 12:01:00','6'), ('Настроить архивацию','1','2018-03-01 11:01:00','2018-05-04 12:01:00','4');
--Queries
--Список из проектов для одного пользователя
select *  from Projects p join Users u on u.id = p.user_id where u.name='dima';
--Список из задач для одного проекта
select *  from Tasks t join Projects p on p.id = t.project_id where p.name_project='Работа';
--Добавляем дату завершения задачи т.е. выполнена
update Tasks set date_done='2018-04-20 13:06:00' where name_task='Выполнить тестовое задание';
--получить задачи для завтрашнего дня 
select * from Tasks where date_alarm=DATE_ADD(NOW(),INTERVAL 1 DAY);
--Обновить название задачи по идентификатору
update Tasks set name_task='Купить корм для скота' where id='5';





